---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BentFabricParamStraightWiresLocation
source: html/5f25b59b-c2ff-5b00-c535-ce49bf442f41.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BentFabricParamStraightWiresLocation Property

"Straight Wires Location": Location of straight wires in a bent fabric.

## Syntax (C#)
```csharp
public static ForgeTypeId BentFabricParamStraightWiresLocation { get; }
```